{
    "slug": "chess",
    "title": "Chess",
    "main-requirement-of-game": "Battlefield 3 PC Download Free Full Game. Battlefield 3 can be installed on windows 10, windows 8 and windows 7. System Requirements, Cheats, Walkthrough, Gameplay, and Mods. Battlefield 3 is an Action Game.",
    "main_image": "https://i0.wp.com/www.pcgamespunch.com/wp-content/uploads/2013/08/Battlefied-3-5.jpg?resize=768%2C432",
    "game_title": "TITLE: Battlefield 3™",
    "genre": "GENRE: Action Games",
    "developer": "DEVELOPER: DICE",
    "content-heading": "Battlefield 3 Gameplay and Walkthrough",
    "first_paragraph": "In 2014 17 , Sergeant Henry Blackburn, of Misfit 1-3 Squad, was sent by Captain Quinton Cole with his teammates David Montes, Steve Campo, Christian Matkovic and Jack Chaffin on a mission to locate and bring back a squad of soldiers. Americans, the Viper Squad, which was on patrol. During the mission, earthquakes are felt. Chaffin is injured by a PLR sniper. A few minutes later, when a PLR attack took place, an earthquake struck the city. It is half-buried under the rubble that Blackburn sees for the first time the leader of the PLR, Solomon. After an extraction, Blackburn and his squad are then sent to Tehranthree months later to apprehend the leader of the PLR: Faruk AL-Bashir. During their research, Blackburn’s squad learns that the PLR ​​has acquired Russian nuclear warheads, and that two of the three warheads are missing. Overwhelmed by events, Blackburn asks for support. It is a convoy of M1 Abrams led by Sergeant Jonathan Miller which is deployed to extract the squad from Blackburn. While extracting the squad by helicopter, Miller is captured, then filmed and executed by Solomon.",
    "second-paragraph": "Later, Blackburn and his squad attempt to capture Al-Bashir and find that Solomon has betrayed him. Before dying, Al-Bashir reveals the plan to detonate the nuclear warheads. Shortly after, Blackburn’s team cross paths with and pursue an arms dealer named Kaffarov who was working with Solomon. During the pursuit, they encounter Russian armed forces also attempting to capture Kaffarov. Russian forces attack Blackburn’s team, a Russian hunter kills Matkovic and Campo. The commander of the Russian troops, Dimitri “Dima” Mayakovsky, questions Kaffarov and reveals Solomon’s plan to Blackburn. Cole, the commander, arrives and tries to stop Mayakovsky. Blackburn then shoots Cole to let Dima escape. Because of this,CIA to whom he explains the whole story through flashbacks . Meanwhile, Dima tries to stop the attack on Paris but fails and is swept up in the explosion with his team (he survives the explosion but was severely exposed to radioactivity). CIA agents do not believe Blackburn’s story as Solomon is a CIA informant and therefore could not be linked to any terrorist operations. They believe Russia is responsible for these attacks.",
    "third-paragraph": "With no other choice, Blackburn and Montes, the sole survivor of his team, escape in order to stop the attack on New York . Blackburn manages to kill Solomon and retrieve the nuclear warhead just in time. Sadly, Montes died in the operation, killed by Solomon from a .44 Magnum bullet to the head."
}